constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    Side
    {
        type            empty;
        nFaces          170942;
        startFace       170360;
    }
    Outlet
    {
        type            patch;
        nFaces          254;
        startFace       341302;
    }
    Inlet
    {
        type            patch;
        nFaces          673;
        startFace       341556;
    }
    Airfoil
    {
        type            wall;
        nFaces          237;
        startFace       342229;
    }
)

// ************************************************************************* //
