0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform ( 0.4361 0 0 ) ;

boundaryField
{

	Side
    	{
        	type            empty;
    	}
   	
	Outlet
    	{
        	type            zeroGradient;
    	}
   	
	Airfoil
    	{
        	type            noSlip;
    	}
   	
	Inlet
    	{
        	type            inletOutlet;
		inletValue	uniform ( 0.4361 0 0 );
    	}


}


// ************************************************************************* //
