system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cellPointFace;

setFormat       raw;

sets
(
   profile 
    {
        type    cloud;
        axis    x;
        points   (
( 9.9672610387E-01	     -1.9557395698E-02	     0.0	)    
( 9.9345882166E-01	     -1.9087806556E-02	     0.0	)    
( 9.9018492553E-01	     -1.8604989550E-02	     0.0	)    
( 9.8691102939E-01	     -1.8122172544E-02	     0.0	)    
( 9.8364374719E-01	     -1.7632741607E-02	     0.0	)    
( 9.8036985105E-01	     -1.7143310670E-02	     0.0	)    
( 9.7710256885E-01	     -1.6647265801E-02	     0.0	)    
( 9.7383528665E-01	     -1.6144607000E-02	     0.0	)    
( 9.7056800444E-01	     -1.5641948200E-02	     0.0	)    
( 9.6730072224E-01	     -1.5132675468E-02	     0.0	)    
( 9.6403344004E-01	     -1.4616788804E-02	     0.0	)    
( 9.6076615783E-01	     -1.4100902140E-02	     0.0	)    
( 9.5749887563E-01	     -1.3578401545E-02	     0.0	)    
( 9.5423159343E-01	     -1.3049287018E-02	     0.0	)    
( 9.5097092516E-01	     -1.2520172491E-02	     0.0	)    
( 9.4770364295E-01	     -1.1991057964E-02	     0.0	)    
( 9.4444297468E-01	     -1.1455329506E-02	     0.0	)    
( 9.4118230641E-01	     -1.0912987116E-02	     0.0	)    
( 9.3792163814E-01	     -1.0370644726E-02	     0.0	)    
( 9.3465435594E-01	     -9.8216884045E-03	     0.0	)    
( 9.3139368766E-01	     -9.2727320829E-03	     0.0	)    
( 9.2813301939E-01	     -8.7171618297E-03	     0.0	)    
( 9.2487896505E-01	     -8.1615915765E-03	     0.0	)    
( 9.2161829678E-01	     -7.6060213233E-03	     0.0	)    
( 9.1835762851E-01	     -7.0438371385E-03	     0.0	)    
( 9.1509696024E-01	     -6.4816529538E-03	     0.0	)    
( 9.1184290590E-01	     -5.9194687690E-03	     0.0	)    
( 9.0858223763E-01	     -5.3506706527E-03	     0.0	)    
( 9.0532156935E-01	     -4.7818725363E-03	     0.0	)    
( 9.0206751501E-01	     -4.2130744200E-03	     0.0	)    
( 8.9880684674E-01	     -3.6442763036E-03	     0.0	)    
( 8.9555279240E-01	     -3.0754781873E-03	     0.0	)    
( 8.9229212413E-01	     -2.5000661393E-03	     0.0	)    
( 8.8903806979E-01	     -1.9312680230E-03	     0.0	)    
( 8.8577740152E-01	     -1.3558559750E-03	     0.0	)    
( 8.8252334718E-01	     -7.8044392709E-04	     0.0	)    
( 8.7926929284E-01	     -2.1164581074E-04	     0.0	)    
( 8.7600862457E-01	     3.6376623720E-04	     0.0	)    
( 8.7275457023E-01	     9.3917828514E-04	     0.0	)    
( 8.6949390196E-01	     1.5145903331E-03	     0.0	)    
( 8.6623984762E-01	     2.0833884494E-03	     0.0	)    
( 8.6298579327E-01	     2.6588004974E-03	     0.0	)    
( 8.5972512500E-01	     3.2342125453E-03	     0.0	)    
( 8.5647107066E-01	     3.8096245932E-03	     0.0	)    
( 8.5321040239E-01	     4.3850366412E-03	     0.0	)    
( 8.4995634805E-01	     4.9604486891E-03	     0.0	)    
( 8.4670229371E-01	     5.5292468055E-03	     0.0	)    
( 8.4344162544E-01	     6.1046588534E-03	     0.0	)    
( 8.4018757110E-01	     6.6800709013E-03	     0.0	)    
( 8.3692690283E-01	     7.2554829493E-03	     0.0	)    
( 8.3367284849E-01	     7.8242810656E-03	     0.0	)    
( 8.3041218022E-01	     8.3996931136E-03	     0.0	)    
( 8.2715812588E-01	     8.9751051615E-03	     0.0	)    
( 8.2390407154E-01	     9.5439032779E-03	     0.0	)    
( 8.2064340326E-01	     1.0119315326E-02	     0.0	)    
( 8.1738934892E-01	     1.0688113442E-02	     0.0	)    
( 8.1412868065E-01	     1.1256911559E-02	     0.0	)    
( 8.1087462631E-01	     1.1825709675E-02	     0.0	)    
( 8.0761395804E-01	     1.2394507791E-02	     0.0	)    
( 8.0435328977E-01	     1.2963305908E-02	     0.0	)    
( 8.0109923543E-01	     1.3532104024E-02	     0.0	)    
( 7.9783856716E-01	     1.4094288209E-02	     0.0	)    
( 7.9458451282E-01	     1.4663086325E-02	     0.0	)    
( 7.9132384455E-01	     1.5225270510E-02	     0.0	)    
( 7.8806317627E-01	     1.5787454695E-02	     0.0	)    
( 7.8480250800E-01	     1.6343024948E-02	     0.0	)    
( 7.8154845366E-01	     1.6905209133E-02	     0.0	)    
( 7.7828778539E-01	     1.7460779386E-02	     0.0	)    
( 7.7502711712E-01	     1.8016349639E-02	     0.0	)    
( 7.7176644885E-01	     1.8571919892E-02	     0.0	)    
( 7.6850578058E-01	     1.9120876214E-02	     0.0	)    
( 7.6524511230E-01	     1.9669832535E-02	     0.0	)    
( 7.6198444403E-01	     2.0218788857E-02	     0.0	)    
( 7.5872377576E-01	     2.0767745178E-02	     0.0	)    
( 7.5545649356E-01	     2.1310087568E-02	     0.0	)    
( 7.5219582529E-01	     2.1852429958E-02	     0.0	)    
( 7.4893515701E-01	     2.2394772348E-02	     0.0	)    
( 7.4566787481E-01	     2.2930500807E-02	     0.0	)    
( 7.4240720654E-01	     2.3466229265E-02	     0.0	)    
( 7.3914653827E-01	     2.4001957724E-02	     0.0	)    
( 7.3587925606E-01	     2.4537686182E-02	     0.0	)    
( 7.3261858779E-01	     2.5066800709E-02	     0.0	)    
( 7.2935130559E-01	     2.5595915236E-02	     0.0	)    
( 7.2609063732E-01	     2.6118415831E-02	     0.0	)    
( 7.2282335512E-01	     2.6640916426E-02	     0.0	)    
( 7.1955607291E-01	     2.7163417022E-02	     0.0	)    
( 7.1628879071E-01	     2.7685917617E-02	     0.0	)    
( 7.1302150851E-01	     2.8201804281E-02	     0.0	)    
( 7.0976084023E-01	     2.8717690944E-02	     0.0	)    
( 7.0649355803E-01	     2.9226963676E-02	     0.0	)    
( 7.0322627583E-01	     2.9736236408E-02	     0.0	)    
( 6.9995237969E-01	     3.0245509140E-02	     0.0	)    
( 6.9668509749E-01	     3.0748167941E-02	     0.0	)    
( 6.9341781529E-01	     3.1250826741E-02	     0.0	)    
( 6.9015053308E-01	     3.1746871610E-02	     0.0	)    
( 6.8687663695E-01	     3.2242916479E-02	     0.0	)    
( 6.8360935474E-01	     3.2732347417E-02	     0.0	)    
( 6.8033545861E-01	     3.3221778354E-02	     0.0	)    
( 6.7706817641E-01	     3.3711209291E-02	     0.0	)    
( 6.7379428027E-01	     3.4194026297E-02	     0.0	)    
...
         );
    interpolate true ;
    }
);

fields          ( p  );


// ************************************************************************* //
